problem link: https://leetcode.com/problems/department-highest-salary/description/?lang=pythondata

In [1]:
import pandas as pd

### Generating test cases

In [69]:
employee=pd.read_csv('./test_data/p184_employee_test1.csv',delimiter='|')
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [70]:
employee.dtypes

id               int64
name            object
salary           int64
departmentId     int64
dtype: object

In [71]:
employee.columns

Index(['id', 'name', 'salary', 'departmentId'], dtype='object')

In [72]:
department=pd.read_csv('./test_data/p184_department_test1.csv',delimiter='|')
department

   id   name
0   1     IT
1   2  Sales

In [73]:
department.dtypes

id       int64
name    object
dtype: object

In [74]:
department.columns

Index(['id', 'name'], dtype='object')

### Solving problem

In [75]:
#renaming columns
employee=employee.rename(columns={'name':'Employee','salary':'Salary'})
department=department.rename(columns={'name':'Department','id':'departmentId'})

In [76]:
#merging the dataframes
employee=employee.merge(department,on='departmentId')
employee

   id Employee  Salary  departmentId Department
0   1      Joe   70000             1         IT
1   2      Jim   90000             1         IT
2   3    Henry   80000             2      Sales
3   4      Sam   60000             2      Sales
4   5      Max   90000             1         IT

In [77]:
#getting dept wise max salary 
max_salary=employee.groupby(by='Department')['Salary'].max().rename('Max Salary').reset_index()
employee=employee.merge(max_salary,on='Department')
employee

   id Employee  Salary  departmentId Department  Max Salary
0   1      Joe   70000             1         IT       90000
1   2      Jim   90000             1         IT       90000
2   3    Henry   80000             2      Sales       80000
3   4      Sam   60000             2      Sales       80000
4   5      Max   90000             1         IT       90000

In [78]:
result=employee[employee['Salary']==employee['Max Salary']][['Department','Employee','Salary']]
result

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000

### Preparing Submission function

In [64]:
import pandas as pd

def department_highest_salary(employee: pd.DataFrame, department: pd.DataFrame) -> pd.DataFrame:
    #renaming columns
    employee=employee.rename(columns={'name':'Employee','salary':'Salary'})
    department=department.rename(columns={'name':'Department','id':'departmentId'})

    #merging the dataframes
    employee=employee.merge(department,on='departmentId')

    #getting dept wise max salary 
    max_salary=employee.groupby(by='Department')['Salary'].max().rename('Max Salary').reset_index()
    employee=employee.merge(max_salary,on='Department')
    
    return employee[employee['Salary']==employee['Max Salary']][['Department','Employee','Salary']]

### Testing the submission function

In [65]:
employee=pd.read_csv('./test_data/p184_employee_test1.csv',delimiter='|')
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [66]:
department=pd.read_csv('./test_data/p184_department_test1.csv',delimiter='|')
department

   id   name
0   1     IT
1   2  Sales

In [67]:
department_highest_salary(employee=employee,department=department)

  Department Employee  Salary
1         IT      Jim   90000
2      Sales    Henry   80000
4         IT      Max   90000